temp1/src/Catalogs/СпискиАдресовЭлектроннойПочты/СпискиАдресовЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпискиАдресовЭлектроннойПочты</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАдреса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Адреса</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/Catalogs/СпискиАдресовЭлектроннойПочты/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	ПредставлениеАдреса = "";
	
	Для Каждого Строка Из Адреса Цикл
		
		ПредставлениеСтроки = Строка.Представление;
		
		Если Не ЗначениеЗаполнено(ПредставлениеСтроки) Тогда
			ПредставлениеСтроки = Строка.Адрес;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ПредставлениеАдреса) Тогда
			ПредставлениеАдреса = ПредставлениеАдреса + "; ";
		КонецЕсли;	
		
		ПредставлениеАдреса = ПредставлениеАдреса + ПредставлениеСтроки;
		
	КонецЦикла;	
	
КонецПроцедуры
